<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Adobe's Creative Cloud Desktop App Installer.
    Set the ARCHITECTURE override to "osx10" to download the Intel or "macarm64" for Apple Silicon.</string>
    <key>Identifier</key>
    <string>com.github.rtrouton.download.AdobeCreativeCloudInstallerUniversal</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Creative Cloud Installer</string>
        <key>VENDOR</key>
        <string>Adobe</string>
        <key>SOFTWARETITLE</key>
        <string>Creative Cloud Installer</string>
        <key>NAMEWITHOUTSPACES</key>
        <string>CreativeCloudInstaller</string>
        <key>SEARCH_URL</key>
        <string>https://helpx.adobe.com/download-install/kb/creative-cloud-desktop-app-download.html</string>
        <key>INTEL_SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http.*?://ccmdl.adobe.com/AdobeProducts/KCCC/CCD/.*?/%INTEL_ARCHITECTURE%/ACCC.*?.dmg)</string>
        <key>APPLE_SILICON_SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http.*?://ccmdl.adobe.com/AdobeProducts/KCCC/CCD/.*?/%APPLE_SILICON_ARCHITECTURE%/ACCC.*?.dmg)</string>
        <key>INTEL_ARCHITECTURE</key>
        <string>osx10</string>
        <key>APPLE_SILICON_ARCHITECTURE</key>
        <string>macarm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%INTEL_SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads/intel</string>
                <key>filename</key>
                <string>adobe.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Intel</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install.app</string>
                <key>requirement</key>
                <string>identifier "com.adobe.cc.Install" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/packages/ApplicationInfo.xml</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Intel/ApplicationInfo.xml</string>
                <key>overwrite</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>xml_path</key>
                <string>%RECIPE_CACHE_DIR%/Intel/ApplicationInfo.xml</string>
                <key>elements</key>
                <array>
                    <dict>
                        <key>xpath</key>
                        <string>version</string>
                        <key>text</key>
                        <string>version</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>XMLReader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%APPLE_SILICON_SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads/applesilicon</string>
                <key>filename</key>
                <string>adobe.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict/>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/AppleSilicon</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install.app</string>
                <key>requirement</key>
				<string>identifier "com.adobe.cc.Install" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/packages/ApplicationInfo.xml</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/AppleSilicon/ApplicationInfo.xml</string>
                <key>overwrite</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>xml_path</key>
                <string>%RECIPE_CACHE_DIR%/AppleSilicon/ApplicationInfo.xml</string>
                <key>elements</key>
                <array>
                    <dict>
                        <key>xpath</key>
                        <string>version</string>
                        <key>text</key>
                        <string>version</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>XMLReader</string>
        </dict>
    </array>
</dict>
</plist>