<?xml version="1.0" ?>
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest Outlook and verifies its signature.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.Autopkg-outlook</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Autopkg-Outlook</string>
      <key>DOWNLOAD_URL</key>
      <string>https://go.microsoft.com/fwlink/?linkid=525137</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%DOWNLOAD_URL%</string>
          <key>filename</key>
          <string>%NAME%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
          <key>input_path</key>
          <string>%pathname%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
